Repository: 000geid/base-conversion
Catalog: django_app/locale/*/LC_MESSAGES/django.po
Languages: es

source: Number Converter
es: Convertidor de Números

source: Welcome to Our Utility App!
es: ¡Bienvenido a Nuestra Aplicación de Utilidades!

source: Your one-stop solution for various conversions and calculations. Explore the tabs below to access different tools.
es: Tu solución integral para diversas conversiones y cálculos. Explora las pestañas a continuación para acceder a diferentes herramientas.

source: Arithmetic Calculator
es: Calculadora Aritmética

source: Calculator (Coming Soon)
es: Calculadora (Próximamente)

source: Number Base Converter
es: Convertidor de Base Numérica

source: Enter number:
es: Ingrese número:

source: From base:
es: Desde la base:

source: Binary
es: Binario

source: Swap bases
es: Intercambiar bases

source: To base:
es: A la base:

source: Convert
es: Convertir

source: Result:
es: Resultado:

source: Number 1:
es: Número 1:

source: Number 2:
es: Número 2:

source: Base for numbers:
es: Base para los números:

source: Number 1 (Decimal):
es: Número 1 (Decimal):

source: Number 2 (Decimal):
es: Número 2 (Decimal):

source: Add
es: Sumar

source: Subtract
es: Restar

source: Multiply
es: Multiplicar

source: Divide
es: Dividir

source: In original base
es: En base original

source: In Decimal:
es: En Decimal:

source: Calculator
es: Calculadora

source: This feature is coming soon!
es: ¡Esta funcionalidad estará disponible próximamente!

source: Invalid base for conversion to decimal.
es: Base inválida para la conversión a decimal.

source: Invalid base for conversion from decimal.
es: Base inválida para la conversión desde decimal.

source: Please enter a number to convert.
es: Por favor, ingrese un número para convertir.

source: Error converting number: {error_message}. Please check your input and selected bases.
es: Error al convertir el número: {error_message}. Por favor, revise su entrada y las bases seleccionadas.

source: An unexpected error occurred during conversion: {error_message}
es: Ocurrió un error inesperado durante la conversión: {error_message}

source: Please enter both numbers for calculation.
es: Por favor, ingrese ambos números para la calculación.

source: Please select an operation.
es: Por favor, seleccione una operación.

source: Division by zero is not allowed.
es: La división por cero no está permitida.

source: Invalid operation selected.
es: Operación inválida seleccionada.

source: Error in calculation: {error_message}. Please check your inputs and selected base.
es: Error en la calculación: {error_message}. Por favor, revise sus entradas y la base seleccionada.

source: An unexpected error occurred during calculation: {error_message}
es: Ocurrió un error inesperado durante la calculación: {error_message}

source: Understanding Number Systems
es: Entendiendo los Sistemas Numéricos

source: What are Number Systems?
es: ¿Qué son los Sistemas Numéricos?

source: A number system is a way of representing numbers using a specific set of symbols or digits. The most common number system we use daily is the decimal system (base 10), but computers and digital systems use other bases like binary, octal, and hexadecimal.
es: Un sistema numérico es una forma de representar números usando un conjunto específico de símbolos o dígitos. El sistema numérico más común que usamos diariamente es el sistema decimal (base 10), pero las computadoras y sistemas digitales usan otras bases como binario, octal y hexadecimal.

source: Uses digits 0-9. Each position represents a power of 10.
es: Usa dígitos 0-9. Cada posición representa una potencia de 10.

source: Example:
es: Ejemplo:

source: Binary (Base 2)
es: Binario (Base 2)

source: Uses only 0 and 1. Used in computer systems.
es: Usa solo 0 y 1. Utilizado en sistemas computacionales.

source: Uses digits 0-7. Often used in computing.
es: Usa dígitos 0-7. Frecuentemente usado en computación.

source: Uses digits 0-9 and letters A-F. Common in programming.
es: Usa dígitos 0-9 y letras A-F. Común en programación.

source: Why Learn About Different Bases?
es: ¿Por qué Aprender sobre Diferentes Bases?

source: Programming:
es: Programación:

source: Understanding binary and hexadecimal is essential for computer programming
es: Entender binario y hexadecimal es esencial para la programación de computadoras

source: Mathematics:
es: Matemáticas:

source: Different bases help understand mathematical concepts and number theory
es: Las diferentes bases ayudan a entender conceptos matemáticos y teoría de números

source: Computing:
es: Computación:

source: Computers process information in binary, making it fundamental to digital technology
es: Las computadoras procesan información en binario, haciéndolo fundamental para la tecnología digital

source: Problem Solving:
es: Resolución de Problemas:

source: Base conversions develop logical thinking and mathematical skills
es: Las conversiones de bases desarrollan el pensamiento lógico y las habilidades matemáticas

source: Ready to Practice?
es: ¿Listo para Practicar?

source: Now that you understand the theory, let's put it into practice!
es: ¡Ahora que entiendes la teoría, pongámosla en práctica!

source: Try Our Calculator!
es: ¡Prueba Nuestra Calculadora!

source: Interactive Tools
es: Herramientas Interactivas
